src/test/jmeter/results/summary_spike_test_2.csv
Label,# Samples,Average,Min,Max,Std. Dev.,Error %,Throughput,Received KB/sec,Sent KB/sec,Avg. Bytes
GET Homepage,25033,4998,4,12237,3074.88,0.000%,199.75582,1089.10,54.43,5583.0
GET ChatBot,24086,2260,1,6593,2287.62,0.000%,193.43854,657.77,28.52,3482.0
GET Mappa,23530,2176,1,6597,2214.30,0.000%,189.10231,912.82,27.52,4943.0
TOTAL,72649,3176,1,12237,2885.76,0.000%,579.71720,2649.01,110.09,4679.1